Taxi/test_billing_functions/pipelines/af_geo_booking_decision/static/test_create_entries/test_data.json

{
  "af_decision_doc": {
    "$load_py_json": "_af_decision.json"
  },
  "base_doc": {
    "$Doc": {
      "data": {
        "agreement": {
          "ref": "subvention_agreement/1/default/_id/5dc45e833fd694916ab26be1",
          "rule_data": {
            "currency": "RUB",
            "min_online_minutes": 2,
            "rate_free_per_minute": "4",
            "rate_on_order_per_minute": "5",
            "rule_type": "guarantee"
          }
        },
        "antifraud": {
          "antifraud_id": "antifraud_id",
          "decision": "pay",
          "till": "2020-12-30T03:00:01+03:00"
        },
        "contract_payment": {
          "contract_id": 123456,
          "currency_rate": "1.00000",
          "donate_multiplier": "1",
          "is_netting": true,
          "service_id": 111,
          "value": {
            "amount": "100",
            "currency": "RUB"
          }
        },
        "driver": {
          "clid": "some_clid",
          "driver_profile_id": "some_driver_profile_id",
          "park_id": "some_park_id",
          "unique_driver_id": "some_unique_driver_id"
        },
        "enrichment": {
          "billing_client_id": "some_billing_client_id",
          "city_id": "Москва",
          "contracts": {
            "actual_ts": "2020-07-05T21:00:00.000000+00:00",
            "items": [
              {
                "currency": "RUB",
                "id": 123456,
                "target": "oebs"
              }
            ],
            "service_to_contract": {
              "111": 123456
            }
          },
          "country_code": "rus",
          "driver_license_personal_id": "some_driver_license_personal_id",
          "oebs_mvp_id": "MSKc"
        },
        "orders": {
          "count": 2,
          "order_ids": [
            "some_order_1",
            "some_order_2"
          ]
        },
        "payment": {
          "amount": "100",
          "online_cost": "110"
        },
        "payment_meta": {
          "billing_at": "2020-07-04T21:00:00.000000+00:00",
          "budget_id": "some_budget_id",
          "payment_ref": "some_payment_ref",
          "tariff_zone": "moscow",
          "time_zone": "Europe/Moscow"
        },
        "progress": {
          "income": "10.0000",
          "online_time": "3.0000",
          "time_free_minutes": 15,
          "time_on_order_minutes": 2
        },
        "shift": {
          "end": "2020-07-05T21:00:00.000000+00:00",
          "start": "2020-07-04T21:00:00.000000+00:00"
        }
      },
      "entry_ids": [],
      "event_at": {
        "$datetime": "1991-06-18T07:15:00+03:00"
      },
      "external_ref": "some_external_ref_idk",
      "id": 100,
      "kind": "taxi_geo_booking_shift",
      "process_at": {
        "$datetime": "1991-06-18T07:15:00+03:00"
      },
      "revision": 1,
      "status": "complete",
      "topic": "taxi_shift_topic"
    }
  },
  "expected_query": {
    "$Query": {
      "base_doc_ref": 101,
      "base_doc_version": 1,
      "entries": null,
      "entries_save_version": 3,
      "history_item_tags": [],
      "history_start": {
        "$datetime": "2020-07-05T00:00:00+03:00"
      },
      "history_tag": "pay",
      "minimize_reversals": true,
      "now": {
        "$datetime": "2021-03-01T00:00:00.000000+03:00"
      },
      "payment_ref": "some_payment_ref",
      "reversal_entry_customizers": [
        {
          "$DriverIncomeCustomizer": {}
        },
        {
          "$TLogV1Customizer": {
            "base_doc_id": 101
          }
        },
        {
          "$TLogV2Customizer": {
            "af_decision": {
              "$antifraud_decision": "pay"
            }
          }
        }
      ],
      "templates": [
        {
          "$Template": {
            "context": {
              "base_doc_id": 100,
              "base_doc_version": 1,
              "contract": {
                "currency_rate": "1.00000",
                "donate_multiplier": "1",
                "id": "123456",
                "is_payable": false,
                "service_id": 111,
                "target": "oebs"
              },
              "driver": {
                "billing_client_id": "some_billing_client_id",
                "clid": "some_clid",
                "driver_uuid": "some_driver_profile_id",
                "park_id": "some_park_id"
              },
              "entries_save_version": {
                "$entries_save_version": 3
              },
              "subvention": {
                "contract_value": {
                  "amount": "100",
                  "currency": "RUB"
                },
                "details": {
                  "agglomeration": "MSKc",
                  "date": "2020-07-05",
                  "external_ref": "subsidy/some_payment_ref",
                  "free_minutes": 15,
                  "income": "10.0000",
                  "last_day_of_shift": "2020-07-05T00:00:00+03:00",
                  "limit_ref": "some_budget_id",
                  "on_order_minutes": 2,
                  "payment_ref": "some_payment_ref",
                  "related_orders_ids": [
                    "some_order_1",
                    "some_order_2"
                  ],
                  "rule_db_id": "5dc45e833fd694916ab26be1",
                  "rule_type": "guarantee",
                  "tariff_zone": "moscow"
                },
                "value": {
                  "amount": "100",
                  "currency": "RUB"
                }
              }
            },
            "name": "subvention_geo_booking"
          }
        }
      ]
    }
  },
  "expected_results": {
    "$load_py_json": "_expected_results.json"
  }
}
