Taxi/test_billing_functions/pipelines/shuttle_order/static/test_create_entries/test_data.json

{
  "expected_accounts": [
    {
      "$Account": {
        "agreement_id": "agreement_id",
        "currency": "RUB",
        "entity_external_id": "taximeter_driver_id/7f74df331eb04ad78bc2ff25ff88a8f2/657dde13c5a14ef3a320c58c58a27b19",
        "id": 1,
        "sub_account": "guarantee"
      }
    },
    {
      "$Account": {
        "agreement_id": "agreement_id",
        "currency": "RUB",
        "entity_external_id": "taximeter_driver_id/7f74df331eb04ad78bc2ff25ff88a8f2/657dde13c5a14ef3a320c58c58a27b19",
        "id": 2,
        "sub_account": "guarantee/on_order"
      }
    },
    {
      "$Account": {
        "agreement_id": "agreement_id",
        "currency": "XXX",
        "entity_external_id": "taximeter_driver_id/7f74df331eb04ad78bc2ff25ff88a8f2/657dde13c5a14ef3a320c58c58a27b19",
        "id": 3,
        "sub_account": "time/on_order_minutes"
      }
    },
    {
      "$Account": {
        "agreement_id": "agreement_id",
        "currency": "RUB",
        "entity_external_id": "taximeter_driver_id/7f74df331eb04ad78bc2ff25ff88a8f2/657dde13c5a14ef3a320c58c58a27b19",
        "id": 4,
        "sub_account": "income/cash"
      }
    },
    {
      "$Account": {
        "agreement_id": "agreement_id",
        "currency": "RUB",
        "entity_external_id": "taximeter_driver_id/7f74df331eb04ad78bc2ff25ff88a8f2/657dde13c5a14ef3a320c58c58a27b19",
        "id": 5,
        "sub_account": "income"
      }
    },
    {
      "$Account": {
        "agreement_id": "taxi/yandex_ride+0/mode/driver_fix",
        "currency": "RUB",
        "entity_external_id": "taximeter_driver_id/7f74df331eb04ad78bc2ff25ff88a8f2/657dde13c5a14ef3a320c58c58a27b19",
        "id": 6,
        "sub_account": "order_cost"
      }
    },
    {
      "$Account": {
        "agreement_id": "taxi/yandex_ride+0/mode/driver_fix",
        "currency": "XXX",
        "entity_external_id": "taximeter_driver_id/7f74df331eb04ad78bc2ff25ff88a8f2/657dde13c5a14ef3a320c58c58a27b19",
        "id": 7,
        "sub_account": "num_orders/completed"
      }
    },
    {
      "$Account": {
        "agreement_id": "taxi/yandex_ride+0/mode/driver_fix",
        "currency": "XXX",
        "entity_external_id": "taximeter_driver_id/7f74df331eb04ad78bc2ff25ff88a8f2/657dde13c5a14ef3a320c58c58a27b19",
        "id": 8,
        "sub_account": "num_orders"
      }
    },
    {
      "$Account": {
        "agreement_id": "taxi/yandex_ride/mode/driver_fix",
        "currency": "RUB",
        "entity_external_id": "taximeter_driver_id/7f74df331eb04ad78bc2ff25ff88a8f2/657dde13c5a14ef3a320c58c58a27b19",
        "id": 9,
        "sub_account": "payment/cash"
      }
    },
    {
      "$Account": {
        "agreement_id": "taxi/yandex_ride/mode/driver_fix",
        "currency": "RUB",
        "entity_external_id": "taximeter_park_id/7f74df331eb04ad78bc2ff25ff88a8f2",
        "id": 10,
        "sub_account": "payment/cash"
      }
    },
    {
      "$Account": {
        "agreement_id": "taxi/yandex_ride+0/mode/driver_fix",
        "currency": "RUB",
        "entity_external_id": "taximeter_driver_id/7f74df331eb04ad78bc2ff25ff88a8f2/657dde13c5a14ef3a320c58c58a27b19",
        "id": 11,
        "sub_account": "payment/cash"
      }
    },
    {
      "$Account": {
        "agreement_id": "subvention/counter/counter",
        "currency": "XXX",
        "entity_external_id": "unique_driver_id/5b05621ee6c22ea2654849f4",
        "id": 12,
        "sub_account": "num_orders"
      }
    },
    {
      "$Account": {
        "agreement_id": "subvention/counter/counter/1",
        "currency": "XXX",
        "entity_external_id": "unique_driver_id/5b05621ee6c22ea2654849f4",
        "id": 13,
        "sub_account": "num_orders"
      }
    },
    {
      "$Account": {
        "agreement_id": "subvention/counter/personal_counter",
        "currency": "XXX",
        "entity_external_id": "unique_driver_id/5b05621ee6c22ea2654849f4",
        "id": 14,
        "sub_account": "num_orders"
      }
    },
    {
      "$Account": {
        "agreement_id": "subvention/counter/personal_counter/1",
        "currency": "XXX",
        "entity_external_id": "unique_driver_id/5b05621ee6c22ea2654849f4",
        "id": 15,
        "sub_account": "num_orders"
      }
    }
  ],
  "expected_journal": [
    {
      "$AppendedEntry": {
        "account_id": 1,
        "amount": {
          "$decimal": "0"
        },
        "created": {
          "$datetime": "2021-05-18T00:00:00+00:00"
        },
        "details": {
          "intervals": []
        },
        "doc_ref": 1234567890,
        "event_at": {
          "$datetime": "2020-12-22T08:48:39.046000+00:00"
        },
        "id": 1,
        "idempotency_key": "df_guarantee/2"
      }
    },
    {
      "$AppendedEntry": {
        "account_id": 2,
        "amount": {
          "$decimal": "0"
        },
        "created": {
          "$datetime": "2021-05-18T00:00:00+00:00"
        },
        "details": {
          "intervals": []
        },
        "doc_ref": 1234567890,
        "event_at": {
          "$datetime": "2020-12-22T08:48:39.046000+00:00"
        },
        "id": 2,
        "idempotency_key": "df_guarantee_on_order/2"
      }
    },
    {
      "$AppendedEntry": {
        "account_id": 3,
        "amount": {
          "$decimal": "0"
        },
        "created": {
          "$datetime": "2021-05-18T00:00:00+00:00"
        },
        "details": {
          "order_completed_at": "2020-12-22T11:48:39.046000+03:00",
          "order_id": "28e560e5a7c26a6bbc3ba9b73ab9657a"
        },
        "doc_ref": 1234567890,
        "event_at": {
          "$datetime": "2020-12-22T08:48:39.046000+00:00"
        },
        "id": 3,
        "idempotency_key": "df_on_order_min/2"
      }
    },
    {
      "$AppendedEntry": {
        "account_id": 4,
        "amount": {
          "$decimal": "272"
        },
        "created": {
          "$datetime": "2021-05-18T00:00:00+00:00"
        },
        "details": {},
        "doc_ref": 1234567890,
        "event_at": {
          "$datetime": "2020-12-22T08:48:39.046000+00:00"
        },
        "id": 4,
        "idempotency_key": "df_income_cash/2"
      }
    },
    {
      "$AppendedEntry": {
        "account_id": 5,
        "amount": {
          "$decimal": "272"
        },
        "created": {
          "$datetime": "2021-05-18T00:00:00+00:00"
        },
        "details": {},
        "doc_ref": 1234567890,
        "event_at": {
          "$datetime": "2020-12-22T08:48:39.046000+00:00"
        },
        "id": 5,
        "idempotency_key": "df_income/2"
      }
    },
    {
      "$AppendedEntry": {
        "account_id": 6,
        "amount": {
          "$decimal": "272"
        },
        "created": {
          "$datetime": "2021-05-18T00:00:00+00:00"
        },
        "details": {},
        "doc_ref": 1234567890,
        "event_at": {
          "$datetime": "2020-12-22T08:48:39.046000+00:00"
        },
        "id": 6,
        "idempotency_key": "df_order_cost/2"
      }
    },
    {
      "$AppendedEntry": {
        "account_id": 7,
        "amount": {
          "$decimal": "1"
        },
        "created": {
          "$datetime": "2021-05-18T00:00:00+00:00"
        },
        "details": {},
        "doc_ref": 1234567890,
        "event_at": {
          "$datetime": "2020-12-22T08:48:39.046000+00:00"
        },
        "id": 7,
        "idempotency_key": "df_num_orders/completed/2"
      }
    },
    {
      "$AppendedEntry": {
        "account_id": 8,
        "amount": {
          "$decimal": "1"
        },
        "created": {
          "$datetime": "2021-05-18T00:00:00+00:00"
        },
        "details": {},
        "doc_ref": 1234567890,
        "event_at": {
          "$datetime": "2020-12-22T08:48:39.046000+00:00"
        },
        "id": 8,
        "idempotency_key": "df_num_orders/2"
      }
    },
    {
      "$AppendedEntry": {
        "account_id": 9,
        "amount": {
          "$decimal": "272"
        },
        "created": {
          "$datetime": "2021-05-18T00:00:00+00:00"
        },
        "details": {},
        "doc_ref": 1234567890,
        "event_at": {
          "$datetime": "2021-05-18T00:00:00+00:00"
        },
        "id": 9,
        "idempotency_key": "cash_payment/2/payment/driver"
      }
    },
    {
      "$AppendedEntry": {
        "account_id": 10,
        "amount": {
          "$decimal": "272"
        },
        "created": {
          "$datetime": "2021-05-18T00:00:00+00:00"
        },
        "details": {
          "driver": {
            "driver_uuid": "657dde13c5a14ef3a320c58c58a27b19"
          }
        },
        "doc_ref": 1234567890,
        "event_at": {
          "$datetime": "2021-05-18T00:00:00+00:00"
        },
        "id": 10,
        "idempotency_key": "cash_payment/2/payment/park"
      }
    },
    {
      "$AppendedEntry": {
        "account_id": 11,
        "amount": {
          "$decimal": "272"
        },
        "created": {
          "$datetime": "2021-05-18T00:00:00+00:00"
        },
        "details": {},
        "doc_ref": 1234567890,
        "event_at": {
          "$datetime": "2020-12-22T08:48:39.046000+00:00"
        },
        "id": 11,
        "idempotency_key": "cash_payment/2/payment/yandex_ride+0"
      }
    },
    {
      "$AppendedEntry": {
        "account_id": 12,
        "amount": {
          "$decimal": "2.0000"
        },
        "created": {
          "$datetime": "2021-05-18T00:00:00+00:00"
        },
        "details": {
          "order_id": "28e560e5a7c26a6bbc3ba9b73ab9657a"
        },
        "doc_ref": 1234567890,
        "event_at": {
          "$datetime": "2020-12-22T08:48:39.046000+00:00"
        },
        "id": 12,
        "idempotency_key": "goal_num_orders/counter/2"
      }
    },
    {
      "$AppendedEntry": {
        "account_id": 13,
        "amount": {
          "$decimal": "2.0000"
        },
        "created": {
          "$datetime": "2021-05-18T00:00:00+00:00"
        },
        "details": {
          "order_id": "28e560e5a7c26a6bbc3ba9b73ab9657a"
        },
        "doc_ref": 1234567890,
        "event_at": {
          "$datetime": "2020-12-22T08:48:39.046000+00:00"
        },
        "id": 13,
        "idempotency_key": "goal_num_orders_per_contract/counter/2"
      }
    },
    {
      "$AppendedEntry": {
        "account_id": 14,
        "amount": {
          "$decimal": "2.0000"
        },
        "created": {
          "$datetime": "2021-05-18T00:00:00+00:00"
        },
        "details": {
          "order_id": "28e560e5a7c26a6bbc3ba9b73ab9657a"
        },
        "doc_ref": 1234567890,
        "event_at": {
          "$datetime": "2020-12-22T08:48:39.046000+00:00"
        },
        "id": 14,
        "idempotency_key": "goal_num_orders/personal_counter/2"
      }
    },
    {
      "$AppendedEntry": {
        "account_id": 15,
        "amount": {
          "$decimal": "2.0000"
        },
        "created": {
          "$datetime": "2021-05-18T00:00:00+00:00"
        },
        "details": {
          "order_id": "28e560e5a7c26a6bbc3ba9b73ab9657a"
        },
        "doc_ref": 1234567890,
        "event_at": {
          "$datetime": "2020-12-22T08:48:39.046000+00:00"
        },
        "id": 15,
        "idempotency_key": "goal_num_orders_per_contract/personal_counter/2"
      }
    }
  ],
  "expected_results": {
    "$Results": {
      "doc_update": {
        "$LastEntries": {
          "adopted_entry_ids": [],
          "entry_ids": [
            1,
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9,
            10,
            11,
            12,
            13,
            14,
            15
          ],
          "history_doc_id": 1,
          "reversal_entry_ids": []
        }
      },
      "entry_ids": [
        1,
        2,
        3,
        4,
        5,
        6,
        7,
        8,
        9,
        10,
        11,
        12,
        13,
        14,
        15
      ],
      "eta": null,
      "is_completed": true,
      "is_postponed": false,
      "next_status": "complete"
    }
  },
  "shuttle_order": {
    "$Doc": {
      "data": {
        "cash_payment": {
          "order_cost": "272.0"
        },
        "contracts": {
          "actual_ts": "2020-12-30T03:00:00+03:00",
          "items": [
            {
              "currency": "RUB",
              "id": 1
            }
          ],
          "service_to_contract": {
            "111": 1,
            "128": 1,
            "137": 1
          }
        },
        "driver": {
          "billing_client_id": "100500",
          "clid": "643753730233",
          "driver_profile_id": "657dde13c5a14ef3a320c58c58a27b19",
          "park_id": "7f74df331eb04ad78bc2ff25ff88a8f2",
          "tags": [
            "some_tag"
          ],
          "unique_driver_id": "5b05621ee6c22ea2654849f4"
        },
        "driver_fix": {
          "agreement_id": "agreement_id",
          "balances_change": {
            "guarantee": "0",
            "income": "272",
            "intervals": [],
            "minutes_on_order": "0"
          },
          "shift_ended_doc_id": 12345
        },
        "driver_mode": {
          "mode": "driver_fix",
          "subscription": {
            "doc_id": 100000000,
            "rule_id": "some_rule_id",
            "shift_close_time": "00:00:00+03:00",
            "start": "2020-04-19T00:00:00+03:00"
          }
        },
        "order_income": {
          "driver_balance_change": {
            "amount": "272.0",
            "currency": "RUB"
          },
          "num_orders": 1,
          "num_orders_completed": 1
        },
        "order_info": {
          "billing_at": "2020-12-22T11:48:39.046000+03:00",
          "driver_cost": {
            "amount": "272.0",
            "currency": "RUB"
          },
          "geo_hierarchy": "some_geo_hierarchy",
          "id": "28e560e5a7c26a6bbc3ba9b73ab9657a",
          "oebs_mvp_id": "MSKc",
          "payment_type": "cash",
          "time_zone": "Europe/Moscow",
          "zone_name": "tula"
        },
        "subventions": {
          "antifraud_precheck": {
            "is_goal_allowed": true,
            "is_single_on_top_allowed": true,
            "is_single_ride_allowed": true
          },
          "is_eligible": true,
          "shifts": [
            {
              "data": {
                "contract_id": 1,
                "counter": "counter",
                "kind": "goal",
                "num_orders": 2
              },
              "doc_id": 5000
            },
            {
              "data": {
                "contract_id": 1,
                "counter": "personal_counter",
                "kind": "goal",
                "num_orders": 2
              },
              "doc_id": 5001
            }
          ]
        },
        "version": 1
      },
      "entry_ids": [],
      "event_at": "2020-04-18T15:13:02.000Z",
      "external_ref": "1",
      "id": 1234567890,
      "kind": "shuttle_order",
      "process_at": {
        "$datetime": "1991-06-18T07:15:00+03:00"
      },
      "revision": 1,
      "status": "new",
      "topic": "shuttle/order_id/28e560e5a7c26a6bbc3ba9b73ab9657a"
    }
  }
}
