Taxi/test_billing_functions/functions/static/test_generate_reversal_entries/test_data.json

{
  "existing_entries": [
    {
      "$SelectedEntry": {
        "account_id": 10,
        "agreement_id": "tlog",
        "amount": {
          "$decimal": "6.3600"
        },
        "created": {
          "$datetime": "2020-12-31T23:59:59.999999+03:00"
        },
        "currency": "RUB",
        "details": {
          "agglomeration": "MSKc",
          "client_id": "some_billing_client_id",
          "contract_id": "1",
          "detailed_product": "subsidy_do_x_get_y",
          "due": "2020-12-31T23:59:59.999999+03:00",
          "invoice_date": "2020-12-31T23:59:59.999999+03:00",
          "payload": {
            "alias_id": "noorder/18061991",
            "amount_details": {
              "base_amount": "600",
              "base_currency": "RUB",
              "contract_currency_rate": "0.01000",
              "donate_multiplier": "1.0600"
            },
            "base_doc_id": 18061991,
            "driver_details": {
              "clid": "some_clid",
              "db_id": "some_park_id",
              "uuid": "some_uuid"
            },
            "goal_counter": "counter",
            "nearest_zone": "moscow",
            "order_id": "noorder/18061991"
          },
          "product": "subsidy",
          "service_id": 111,
          "tariff_class": "business",
          "topic": "antifraud_check",
          "transaction_type": "payment"
        },
        "entity_external_id": "billing_client_id/some_billing_client_id",
        "event_at": {
          "$datetime": "2020-12-31T23:59:59.999999+03:00"
        },
        "id": 1,
        "sub_account": "antifraud/subvention/do_x_get_y"
      }
    },
    {
      "$SelectedEntry": {
        "account_id": 20,
        "agreement_id": "taxi/yandex_ride+0",
        "amount": {
          "$decimal": "6.3600"
        },
        "created": {
          "$datetime": "2020-12-31T23:59:59.999999+03:00"
        },
        "currency": "RUB",
        "details": {},
        "entity_external_id": "taximeter_driver_id/some_park_id/some_uuid",
        "event_at": {
          "$datetime": "2020-12-31T23:59:59.999999+03:00"
        },
        "id": 2,
        "sub_account": "subvention/do_x_get_y"
      }
    },
    {
      "$SelectedEntry": {
        "account_id": 30,
        "agreement_id": "taxi/yandex_ride",
        "amount": {
          "$decimal": "6.3600"
        },
        "created": {
          "$datetime": "2020-12-31T23:59:59.999999+03:00"
        },
        "currency": "RUB",
        "details": {
          "alias_id": "noorder/18061991"
        },
        "entity_external_id": "taximeter_driver_id/some_park_id/some_uuid",
        "event_at": {
          "$datetime": "2020-12-31T23:59:59.999999+03:00"
        },
        "id": 3,
        "sub_account": "subvention/do_x_get_y"
      }
    },
    {
      "$SelectedEntry": {
        "account_id": 40,
        "agreement_id": "tlog",
        "amount": {
          "$decimal": "6.3600"
        },
        "created": {
          "$datetime": "2020-12-31T23:59:59.999999+03:00"
        },
        "currency": "USD",
        "details": {
          "agglomeration": "MSKc",
          "alias_id": "noorder/18061991",
          "billing_client_id": "some_billing_client_id",
          "contract_id": "1",
          "detailed_product": "subsidy_do_x_get_y",
          "due": "2020-12-31T23:59:59.999999+03:00",
          "handled_in_trust_flow": false,
          "invoice_date": "2020-12-31T23:59:59.999999+03:00",
          "is_payable": false,
          "limits": {
            "amount": "600",
            "currency": "RUB",
            "limit_ref": "some_limit_ref"
          },
          "order_id": "noorder/18061991",
          "payload": {
            "amount_details": {
              "base_amount": "600",
              "base_currency": "RUB",
              "contract_currency_rate": "0.01000",
              "donate_multiplier": "1.0000"
            },
            "base_doc_id": 18061990,
            "driver_details": {
              "clid": "some_clid",
              "db_id": "some_park_id",
              "uuid": "some_uuid"
            },
            "nearest_zone": "moscow"
          },
          "product": "subvention",
          "service_id": 111,
          "tariff_class": "business",
          "transaction_type": "refund"
        },
        "entity_external_id": "billing_client_id/some_billing_client_id",
        "event_at": {
          "$datetime": "2020-12-31T23:59:59.999999+03:00"
        },
        "id": 4,
        "sub_account": "subvention/do_x_get_y"
      }
    },
    {
      "$SelectedEntry": {
        "account_id": 50,
        "agreement_id": "subvention_agreement/1/default/group_id/group_id_nmfg",
        "amount": {
          "$decimal": "1"
        },
        "created": {
          "$datetime": "2020-12-31T23:59:59.999999+03:00"
        },
        "currency": "XXX",
        "details": {
          "alias_id": "902fe475af72677caea7b8f49db06905",
          "order_id": "28e560e5a7c26a6bbc3ba9b73ab9657a"
        },
        "entity_external_id": "unique_driver_id/5b05621ee6c22ea2654849f4",
        "event_at": {
          "$datetime": "2020-12-31T23:59:59.999999+03:00"
        },
        "id": 5,
        "sub_account": "num_orders"
      }
    }
  ],
  "expected_entries": [
    {
      "$JournalEntryDraft": {
        "agreement_id": "tlog",
        "amount": "6.3600",
        "currency": "RUB",
        "details": {
          "agglomeration": "MSKc",
          "client_id": "some_billing_client_id",
          "contract_id": "1",
          "detailed_product": "subsidy_do_x_get_y",
          "due": "2020-12-31T23:59:59.999999+03:00",
          "invoice_date": "2020-12-31T23:59:59.999999+03:00",
          "payload": {
            "alias_id": "noorder/18061991",
            "amount_details": {
              "base_amount": "600",
              "base_currency": "RUB",
              "contract_currency_rate": "0.01000",
              "donate_multiplier": "1.0600"
            },
            "antifraud_decision": "pay",
            "base_doc_id": 18061991,
            "driver_details": {
              "clid": "some_clid",
              "db_id": "some_park_id",
              "uuid": "some_uuid"
            },
            "goal_counter": "counter",
            "nearest_zone": "moscow",
            "order_id": "noorder/18061991",
            "reverse_entry_id": 1
          },
          "product": "subsidy",
          "service_id": 111,
          "tariff_class": "business",
          "topic": "antifraud_check",
          "transaction_type": "refund"
        },
        "entity_external_id": "billing_client_id/some_billing_client_id",
        "event_at": {
          "$datetime": "2020-02-26T03:00:00+03:00"
        },
        "idempotency_key": "r/1",
        "sub_account": "antifraud/subvention/do_x_get_y"
      }
    },
    {
      "$JournalEntryDraft": {
        "agreement_id": "taxi/yandex_ride+0",
        "amount": "-6.3600",
        "currency": "RUB",
        "details": {
          "reverse_entry_id": 2
        },
        "entity_external_id": "taximeter_driver_id/some_park_id/some_uuid",
        "event_at": {
          "$datetime": "2020-12-31T23:59:59.999999+03:00"
        },
        "idempotency_key": "r/2",
        "sub_account": "subvention/do_x_get_y"
      }
    },
    {
      "$JournalEntryDraft": {
        "agreement_id": "taxi/yandex_ride",
        "amount": "-6.3600",
        "currency": "RUB",
        "details": {
          "alias_id": "noorder/18061991",
          "reverse_entry_id": 3
        },
        "entity_external_id": "taximeter_driver_id/some_park_id/some_uuid",
        "event_at": {
          "$datetime": "2020-02-26T03:00:00+03:00"
        },
        "idempotency_key": "r/3",
        "sub_account": "subvention/do_x_get_y"
      }
    },
    {
      "$JournalEntryDraft": {
        "agreement_id": "tlog",
        "amount": "-6.3600",
        "currency": "USD",
        "details": {
          "agglomeration": "MSKc",
          "alias_id": "noorder/18061991",
          "billing_client_id": "some_billing_client_id",
          "contract_id": "1",
          "detailed_product": "subsidy_do_x_get_y",
          "due": "2020-12-31T23:59:59.999999+03:00",
          "handled_in_trust_flow": false,
          "invoice_date": "2020-12-31T23:59:59.999999+03:00",
          "is_payable": false,
          "limits": {
            "amount": "600",
            "currency": "RUB",
            "limit_ref": "some_limit_ref"
          },
          "order_id": "noorder/18061991",
          "payload": {
            "amount_details": {
              "base_amount": "600",
              "base_currency": "RUB",
              "contract_currency_rate": "0.01000",
              "donate_multiplier": "1.0000"
            },
            "base_doc_id": 18061991,
            "driver_details": {
              "clid": "some_clid",
              "db_id": "some_park_id",
              "uuid": "some_uuid"
            },
            "nearest_zone": "moscow"
          },
          "product": "subvention",
          "reverse_entry_id": 4,
          "service_id": 111,
          "tariff_class": "business",
          "transaction_type": "payment"
        },
        "entity_external_id": "billing_client_id/some_billing_client_id",
        "event_at": {
          "$datetime": "2020-02-26T03:00:00+03:00"
        },
        "idempotency_key": "r/4",
        "sub_account": "subvention/do_x_get_y"
      }
    },
    {
      "$JournalEntryDraft": {
        "agreement_id": "subvention_agreement/1/default/group_id/group_id_nmfg",
        "amount": "-1",
        "currency": "XXX",
        "details": {
          "alias_id": "902fe475af72677caea7b8f49db06905",
          "order_id": "28e560e5a7c26a6bbc3ba9b73ab9657a",
          "reverse_entry_id": 5
        },
        "entity_external_id": "unique_driver_id/5b05621ee6c22ea2654849f4",
        "event_at": {
          "$datetime": "2020-12-31T23:59:59.999999+03:00"
        },
        "idempotency_key": "r/5",
        "sub_account": "num_orders"
      }
    }
  ],
  "query": {
    "$Query": {
      "customizers": [
        {
          "$TLogV2Customizer": {
            "af_decision": {
              "$antifraud_decision": "pay"
            }
          }
        },
        {
          "$TLogV1Customizer": {
            "base_doc_id": 18061991
          }
        },
        {
          "$DriverIncomeCustomizer": {}
        },
        {
          "$SubventionAnalyticalCustomizer": {}
        }
      ],
      "entry_ids": [
        1,
        2,
        3,
        4
      ],
      "event_at": {
        "$datetime": "2020-02-26T00:00:00"
      }
    }
  }
}
