Taxi/test_billing_functions/pipelines/cargo_claim/static/test_forward_entries/test_data.json

{
  "doc": {
    "$Doc": {
      "data": {
        "claim_info": {
          "billing_at": "2022-04-01T00:00:00.000000+03:00",
          "cancel_distance": 50,
          "cancelled_at": "2022-04-01T00:00:00.000000+03:00",
          "city_id": "Москва",
          "closed_without_accept": false,
          "completed_at": "2022-04-01T00:00:00.000000+03:00",
          "cost": {
            "amount": "272.0",
            "currency": "RUB"
          },
          "cost_for_driver": "250",
          "donate_multiplier": "1.06",
          "driver_promocode": {
            "id": "some_driver_promocode_id",
            "is_support_series": true
          },
          "driver_workshift_ids": [],
          "due": "2022-04-01T00:00:00+03:00",
          "fine_code": "some_fine_code",
          "fleet_subscription_level": "LEVEL3",
          "geo_hierarchy": "russia/moscow",
          "has_co_branding": false,
          "has_lightbox": false,
          "has_sticker": false,
          "id": "28e560e5a7c26a6bbc3ba9b73ab9657a",
          "ind_bel_nds_rate": "1.2",
          "is_cargo": false,
          "need_dispatcher_acceptance": false,
          "oebs_mvp_id": "MSKc",
          "park_brandings": [],
          "park_corp_vat": "100",
          "park_ride_sum": "272",
          "payment_type": "card",
          "rebate_rate": "1.4",
          "source": "call_center",
          "status": "finished",
          "subvention_geoareas": [
            "msk-iter4-pol4",
            "msk-polyinpoly-test"
          ],
          "tags": [],
          "tariff_class": "business",
          "tariff_minimal_cost": "100",
          "taxi_alias_id": "902fe475af72677caea7b8f49db06905",
          "taxi_order_id": "some_order_id",
          "taxi_status": "complete",
          "time_zone": "Europe/Moscow",
          "transporting_distance_meters": 10,
          "transporting_time_seconds": 32,
          "zone_name": "moscow"
        },
        "commission": {
          "fee": {
            "driver_balance_change": "61.3333",
            "items": [
              {
                "agreement_id": "fixed_rate_id",
                "amount": "61.3333",
                "contract_currency": "RUB",
                "contract_id": 1,
                "currency_rate": "1.00000",
                "gross": {
                  "amount": "134.9333",
                  "contract_amount": "134.9333",
                  "vat": "73.6000"
                },
                "group": "base",
                "order_cost": "266.6667",
                "service_id": 128,
                "vat": "73.6000"
              }
            ],
            "park_commission": "35.5467",
            "value": "61.3333",
            "value_inc_vat_park_only": "134.9333",
            "vat": "73.6000"
          },
          "is_charged": true,
          "subvention_commission_agreement": {
            "agreement": {
              "branding_discounts": [
                {
                  "marketing_level": [
                    "co_branding",
                    "lightbox"
                  ],
                  "value": "0.04"
                },
                {
                  "marketing_level": [
                    "lightbox"
                  ],
                  "value": "0.02"
                }
              ],
              "cancelation_settings": {
                "billable_cancel_distance": 300,
                "billable_park_interval": {
                  "after_order_due": "420",
                  "before_order_due": "600"
                },
                "billable_user_interval": {
                  "after_order_due": "120",
                  "before_order_due": "600"
                }
              },
              "cost_info": {
                "kind": "boundaries",
                "max_cost": "150000000",
                "min_cost": "0.0000"
              },
              "effective_billing_type": "normal",
              "group": "base",
              "id": "fixed_rate_id",
              "kind": "fixed_rate",
              "rate": {
                "kind": "flat",
                "rate": "0.2300"
              },
              "vat_rate": "1.2"
            }
          }
        },
        "driver": {
          "activity_points": 50,
          "available_tariff_classes": [
            "selfdriving",
            "econom",
            "business"
          ],
          "billing_client_id": "100500",
          "clid": "some_clid",
          "driver_license_personal_id": "some_driver_license_personal_id",
          "driver_profile_id": "657dde13c5a14ef3a320c58c58a27b19",
          "hired_at": "2022-04-01T00:00:00.000000+03:00",
          "hiring_type": "commercial",
          "park_id": "7f74df331eb04ad78bc2ff25ff88a8f2",
          "profile_payment_type_restrictions": "none",
          "unique_driver_id": "some_uniq_driver_id",
          "zone_name": "moscow"
        },
        "last_entries": {
          "adopted_entry_ids": [],
          "entry_ids": [
            1,
            2,
            3
          ],
          "reversal_entry_ids": [
            4,
            5
          ]
        },
        "park_commission_rules": {
          "rules": [
            {
              "amount_aggregator_rate": "0.02",
              "amount_fixed": "0.0000",
              "amount_rate": "0.1333",
              "is_commission_if_platform_commission_is_null_enabled": true,
              "is_platfrom_commission_enabled": true,
              "kind": "order",
              "rule_type_id": "4964b852670045b196e526d59915b777",
              "work_rule_id": "e26a3cf21acfe01198d50030487e046b"
            }
          ]
        },
        "version": 1
      },
      "entry_ids": [],
      "event_at": {
        "$datetime": "2022-04-01T00:00:00.000000+03:00"
      },
      "external_ref": "1",
      "id": 1234567890,
      "kind": "cargo_claim",
      "process_at": {
        "$datetime": "2022-04-01T00:00:00.000000+03:00"
      },
      "revision": 1,
      "status": "create_entries",
      "topic": "some_topic_id"
    }
  },
  "expected_query": {
    "$Query": {
      "aggregator_commission_rate": {
        "$decimal": "0.02"
      },
      "doc_ref": 1234567890,
      "doc_version": 1,
      "driver_profile_id": "657dde13c5a14ef3a320c58c58a27b19",
      "entry_ids": [
        1,
        2,
        3,
        4,
        5
      ],
      "order_cost": {
        "$decimal": "266.6667"
      },
      "park_id": "7f74df331eb04ad78bc2ff25ff88a8f2",
      "timestamp": {
        "$datetime": "2022-04-01T00:00:00.000000+03:00"
      }
    }
  }
}
