Taxi/test_billing_functions/pipelines/eats_goal_shift/static/test_forward_entries/test_data.json

{
  "doc": {
    "$Doc": {
      "data": {
        "agreement": {
          "ref": "subscription/doc_id/12011990",
          "rule_data": {
            "counter": "A",
            "currency": "RUB",
            "rule_id": "2d8e0d52-1767-402d-a572-3976bbcb29a9",
            "steps": [
              {
                "amount": "100.0000",
                "nrides": 10
              }
            ],
            "type": "goal"
          }
        },
        "driver": {
          "driver_license_personal_id": "some_driver_license_personal_id",
          "driver_profile_id": "some_driver_profile_id",
          "park_id": "some_park_id",
          "unique_driver_id": "some_unique_driver_id"
        },
        "last_entries": {
          "entry_ids": [
            1,
            2,
            3
          ]
        },
        "payment_meta": {
          "payment_ref": "some_payment_ref",
          "subvention_ref": "some_subvention_ref",
          "time_zone": "Europe/Moscow"
        },
        "shift": {
          "duration_in_days": 7,
          "end": "2020-07-05T21:00:00.000000+00:00",
          "start": "2020-06-28T21:00:00.000000+00:00"
        },
        "version": 1
      },
      "entry_ids": [],
      "event_at": {
        "$datetime": "1991-06-18T07:15:00+03:00"
      },
      "external_ref": "some_external_ref_idk",
      "id": 18061991,
      "kind": "eats_goal_shift",
      "process_at": {
        "$datetime": "1991-06-18T07:15:00+03:00"
      },
      "revision": 1,
      "status": "forward_payment_entries",
      "topic": "some_topic_idk"
    }
  },
  "expected_query": {
    "$Query": {
      "aggregator_commission_rate": null,
      "doc_ref": 18061991,
      "doc_version": 1,
      "driver_profile_id": "some_driver_profile_id",
      "entry_ids": [
        1,
        2,
        3
      ],
      "order_cost": null,
      "park_id": "some_park_id",
      "timestamp": {
        "$datetime": "1991-06-18T07:15:00+03:00"
      }
    }
  }
}
