Taxi/test_billing_functions/pipelines/eats_goal_shift/static/test_load_shift_orders/test_data.json

{
  "doc": {
    "$Doc": {
      "data": {
        "$Data": {
          "agreement": {
            "ref": "subscription/doc_id/12011990",
            "rule_data": {
              "counter": "A",
              "currency": "RUB",
              "rule_id": "2d8e0d52-1767-402d-a572-3976bbcb29a9",
              "steps": [
                {
                  "amount": "100.0000",
                  "nrides": 10
                }
              ],
              "type": "goal"
            }
          },
          "driver": {
            "driver_license_personal_id": "some_driver_license_personal_id",
            "driver_profile_id": "some_driver_profile_id",
            "park_id": "some_park_id",
            "unique_driver_id": "some_unique_driver_id"
          },
          "payment_meta": {
            "payment_ref": "some_payment_ref",
            "subvention_ref": "some_subvention_ref",
            "time_zone": "Europe/Moscow"
          },
          "shift": {
            "duration_in_days": 7,
            "end": "2020-07-05T21:00:00.000000+00:00",
            "start": "2020-06-28T21:00:00.000000+00:00"
          },
          "version": 1
        }
      },
      "entry_ids": [],
      "event_at": {
        "$datetime": "1991-06-18T07:15:00+03:00"
      },
      "external_ref": "some_external_ref_idk",
      "id": 18061991,
      "kind": "taxi_goal_shift",
      "process_at": {
        "$datetime": "1991-06-18T07:15:00+03:00"
      },
      "revision": 1,
      "status": "ready_for_antifraud_check",
      "topic": "some_topic_idk"
    }
  },
  "expected_query": {
    "$Query": {
      "account": {
        "$Account": {
          "agreement_id": "subscription/doc_id/12011990",
          "currency": "XXX",
          "entity_id": "unique_driver_id/some_unique_driver_id",
          "sub_account": "num_orders"
        }
      },
      "end": {
        "$datetime": "2020-07-05T21:00:00+00:00"
      },
      "limit": 2,
      "start": {
        "$datetime": "2020-06-28T21:00:00+00:00"
      }
    }
  }
}
