Taxi/test_billing_functions/pipelines/fine_order/static/test_forward_entries/test_data.json

{
  "doc": {
    "$Doc": {
      "data": {
        "commission": {
          "items": [
            {
              "agreement_id": "custom_fine_id",
              "amount": "22.0000",
              "category": "fine",
              "fine_code": "rough_courier",
              "gross": {
                "amount": "22.0000",
                "vat": "3.9600"
              },
              "group": "custom_fine",
              "vat": "3.9600"
            }
          ]
        },
        "driver": {
          "billing_client_id": "100500",
          "clid": "643753730233",
          "driver_profile_id": "657dde13c5a14ef3a320c58c58a27b19",
          "park_id": "7f74df331eb04ad78bc2ff25ff88a8f2"
        },
        "fines": [
          {
            "fine_code": "some_fine_code",
            "ticket": "some_ticket"
          }
        ],
        "last_entries": {
          "adopted_entry_ids": [],
          "entry_ids": [
            1,
            2,
            3
          ],
          "reversal_entry_ids": [
            4,
            5
          ]
        },
        "order_info": {
          "alias_id": "902fe475af72677caea7b8f49db06905",
          "billing_at": "2021-05-18T00:00:00+00:00",
          "city_id": "Москва",
          "cost": {
            "currency": "RUB"
          },
          "id": "28e560e5a7c26a6bbc3ba9b73ab9657a",
          "ind_bel_nds_rate": "1.2",
          "is_cargo": false,
          "oebs_mvp_id": "MSKc",
          "payment_type": "card",
          "tags": [],
          "tariff_class": "business",
          "time_zone": "Europe/Moscow",
          "zone_name": "moscow"
        },
        "version": 1
      },
      "entry_ids": [],
      "event_at": {
        "$datetime": "1991-06-18T07:15:00+03:00"
      },
      "external_ref": "1",
      "id": 100,
      "kind": "fine_order",
      "process_at": {
        "$datetime": "1991-06-18T07:15:00+03:00"
      },
      "revision": 1,
      "status": "create_entries",
      "topic": "taxi/alias_id/902fe475af72677caea7b8f49db06905"
    }
  },
  "expected_query": {
    "$Query": {
      "aggregator_commission_rate": null,
      "doc_ref": 100,
      "doc_version": 1,
      "driver_profile_id": "657dde13c5a14ef3a320c58c58a27b19",
      "entry_ids": [
        1,
        2,
        3,
        4,
        5
      ],
      "order_cost": 0,
      "park_id": "7f74df331eb04ad78bc2ff25ff88a8f2",
      "timestamp": {
        "$datetime": "2022-04-01T00:00:00.000000+03:00"
      }
    }
  }
}
