Taxi/test_billing_functions/pipelines/shuttle_order/static/test_fetch_driver_mode/test_data.json

{
  "expected_query": {
    "$Query": {
      "alias_id": "28e560e5a7c26a6bbc3ba9b73ab9657a",
      "as_of": {
        "$datetime": "2020-12-22T11:48:39.046000+03:00"
      },
      "doc_id": 1234567890,
      "driver_profile_id": "657dde13c5a14ef3a320c58c58a27b19",
      "is_testing_migration_mode": false,
      "park_id": "7f74df331eb04ad78bc2ff25ff88a8f2"
    }
  },
  "shuttle_order": {
    "$Doc": {
      "data": {
        "driver": {
          "billing_client_id": "100500",
          "clid": "643753730233",
          "driver_profile_id": "657dde13c5a14ef3a320c58c58a27b19",
          "park_id": "7f74df331eb04ad78bc2ff25ff88a8f2",
          "tags": [
            "some_tag"
          ],
          "unique_driver_id": "5b05621ee6c22ea2654849f4"
        },
        "order_info": {
          "billing_at": "2020-12-22T11:48:39.046000+03:00",
          "driver_cost": {
            "amount": "272.0",
            "currency": "RUB"
          },
          "id": "28e560e5a7c26a6bbc3ba9b73ab9657a",
          "oebs_mvp_id": "MSKc",
          "payment_type": "cash",
          "time_zone": "Europe/Moscow",
          "zone_name": "tula"
        },
        "version": 1
      },
      "entry_ids": [],
      "event_at": "2020-04-18T15:13:02.000Z",
      "external_ref": "1",
      "id": 1234567890,
      "kind": "shuttle_order",
      "process_at": {
        "$datetime": "1991-06-18T07:15:00+03:00"
      },
      "revision": 1,
      "status": "new",
      "topic": "shuttle/order_id/28e560e5a7c26a6bbc3ba9b73ab9657a"
    }
  }
}
