Taxi/test_billing_functions/pipelines/taxi_geo_booking_shift/static/test_load_shift_orders/test_data.json

{
  "doc": {
    "$Doc": {
      "data": {
        "$Data": {
          "agreement": {
            "ref": "subvention_agreement/1/default/_id/5dc45e833fd694916ab26be1",
            "rule_data": {
              "currency": "RUB",
              "min_online_minutes": 2,
              "rate_free_per_minute": "4",
              "rate_on_order_per_minute": "5",
              "rule_type": "guarantee"
            }
          },
          "driver": {
            "clid": "some_clid",
            "driver_profile_id": "some_driver_profile_id",
            "park_id": "some_park_id",
            "unique_driver_id": "some_unique_driver_id"
          },
          "enrichment": {
            "billing_client_id": "some_billing_client_id",
            "city_id": "Москва",
            "contracts": {
              "actual_ts": "2020-07-05T21:00:00.000000+00:00",
              "items": [
                {
                  "currency": "RUB",
                  "id": 123456
                }
              ],
              "service_to_contract": {
                "111": 123456
              }
            },
            "country_code": "rus",
            "driver_license_personal_id": "some_driver_license_personal_id",
            "oebs_mvp_id": "MSKc"
          },
          "last_entries": {
            "entry_ids": [
              1,
              2
            ]
          },
          "payment": {
            "amount": "100",
            "online_cost": "200"
          },
          "payment_meta": {
            "billing_at": "2020-07-04T21:00:00.000000+00:00",
            "budget_id": "some_budget_id",
            "payment_ref": "some_payment_ref",
            "tariff_zone": "moscow",
            "time_zone": "Europe/Moscow"
          },
          "shift": {
            "end": "2020-07-05T21:00:00.000000+00:00",
            "start": "2020-07-04T21:00:00.000000+00:00"
          }
        }
      },
      "entry_ids": [],
      "event_at": {
        "$datetime": "1991-06-18T07:15:00+03:00"
      },
      "external_ref": "some_external_ref_idk",
      "id": 18061991,
      "kind": "taxi_geo_booking_shift",
      "process_at": {
        "$datetime": "1991-06-18T07:15:00+03:00"
      },
      "revision": 1,
      "status": "load_shift_orders",
      "topic": "some_topic_idk"
    }
  },
  "expected_query": {
    "$Query": {
      "account": {
        "$Account": {
          "agreement_id": "subvention_agreement/1/default/_id/5dc45e833fd694916ab26be1",
          "currency": "XXX",
          "entity_id": "unique_driver_id/some_unique_driver_id",
          "sub_account": "time/on_order_minutes"
        }
      },
      "end": {
        "$datetime": "2020-07-05T21:00:00.000000+00:00"
      },
      "limit": 2,
      "start": {
        "$datetime": "2020-07-04T21:00:00.000000+00:00"
      }
    }
  }
}
