Taxi/test_billing_functions/repositories/static/test_support_info/order_subvention/test_data.json

{
  "config_variables": {
    "BILLING_FUNCTIONS_CREATE_ORDER_SUBVENTION_SUPPORT_INFO_DOC": true
  },
  "expected": {
    "doc_id": 5000,
    "docs": [
      {
        "data": {
          "support_info": {
            "data": {
              "payout": {
                "net": {
                  "calculations": [],
                  "value": {
                    "amount": "0.02",
                    "currency": "USD"
                  }
                }
              }
            },
            "kind": "taxi/v2/order/subvention"
          }
        },
        "event_at": "2021-01-01T00:00:00+00:00",
        "external_event_ref": "1/taxi/v2/order/subvention",
        "external_obj_id": "support_info/alias_id/some_alias_id",
        "journal_entries": [],
        "kind": "support_info",
        "process_at": "2021-01-01T00:00:00+00:00",
        "service": "billing-functions",
        "status": "complete",
        "tags": [
          "taxi/alias_id/some_alias_id"
        ]
      }
    ]
  },
  "query": {
    "$load_py_json": "order_subvention/_query.json"
  }
}
